# Pandas 학습

1. 데이터 분석을 위한 모듈
- 데이터 분석 및 가공에 사용되는 파이썬 라이브러리
- 사용 빈도가 굉장히 높음
- Numpy 모듈 기반으로 생성됨

학습 내용

1. 기초 문법 익히기
- 이미 존재하는 파일의 내용을 DataFrame으로 생성하기
- 중복 데이터 처리 기술
- 결측치 처리 하기
- 두개의 DataFrame 병합 : row/column기준

**주요 객체**
1. Series
> A. DataFrame 구성 요소<br>B. 구조가 하나의 column으로 구성(DataFrame의 하나의 컬럼)


2. DataFrame
> A. 가로축과 세로축이 있는 엑셀과 유사한 구조<br>B.series들로 구성

In [2]:
import numpy as np
import pandas as pd

In [3]:
!pip show pandas

Name: pandas
Version: 0.23.4
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: c:\users\playdata\anaconda3\lib\site-packages
Requires: python-dateutil, pytz, numpy
Required-by: seaborn, odo

기초 익히기

In [14]:
s=pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s.values

array([1, 2, 3], dtype=int64)

In [11]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [70]:
# 결측치 반영해보기
# nan - not a number
# 결측치 반영시 Series의 각 요소의 데이터 타입 - float64
s=pd.Series([1, np.nan, 3])
s

0    1.0
1    NaN
2    3.0
dtype: float64

In [77]:
s = pd.Series(['08/12/2018','09/12/2018','10/12/2018','11/12/2018','12/12/2018','13/12/2018'])
s

0    08/12/2018
1    09/12/2018
2    10/12/2018
3    11/12/2018
4    12/12/2018
5    13/12/2018
dtype: object

In [78]:
df=pd.DataFrame(np.random.randn(6, 4),index=s, columns=list('ABCD'))
df

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171
12/12/2018  0.376009  0.566752  1.126454 -0.676682
13/12/2018 -1.500166 -0.922745  0.379572  0.425073

In [79]:
df=pd.DataFrame(np.)

SyntaxError: invalid syntax (<ipython-input-79-c773ff7f45be>, line 1)

In [80]:
df.values

array([[ 0.82919518,  1.63554109,  2.49075793,  0.06221939],
       [-1.05649361, -0.75141227, -0.25510369, -0.36090529],
       [-1.77621829, -1.83599896, -0.39552364,  0.86514822],
       [-0.19319027,  0.49018711, -0.05036702, -0.32717071],
       [ 0.37600894,  0.56675172,  1.12645371, -0.67668186],
       [-1.50016617, -0.92274456,  0.37957247,  0.42507297]])

In [81]:
df.index

Index(['08/12/2018', '09/12/2018', '10/12/2018', '11/12/2018', '12/12/2018',
       '13/12/2018'],
      dtype='object')

<font color='blue'>정리 : seires 생성 방법, yyyymmdd 및 기간을 기준으로 날짜 자동 생성하는 방법, DataFrame 객체 생성 방법, index및 column 적용 방법, DataFrame의 정보 확인하는 방법</font>

In [82]:
# B컬럼값을 기준으로 오름/내림차순
# 오름차순 : ascending = True
# 내림차순 : ascending = False
df.sort_values(by='B', ascending=False)

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
12/12/2018  0.376009  0.566752  1.126454 -0.676682
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
13/12/2018 -1.500166 -0.922745  0.379572  0.425073
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148

In [83]:
type(df)

pandas.core.frame.DataFrame

In [84]:
# DataFrame의 row를 index로 slicing
# #[0:3] - 0, 1, 2의 row
df[0:3]

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148

In [85]:
df[0:4]

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171

<font color='blue'> 정리 : DataFrame에서 일부 row값(index) 반환, index번호, index명</font>

loc 속성<br>
- 데이터 slicing 기술<br>
- loc[index, columns]<br>

In [86]:
df

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171
12/12/2018  0.376009  0.566752  1.126454 -0.676682
13/12/2018 -1.500166 -0.922745  0.379572  0.425073

In [93]:
df.loc[:, ['A','B']]

                   A         B
08/12/2018  0.829195  1.635541
09/12/2018 -1.056494 -0.751412
10/12/2018 -1.776218 -1.835999
11/12/2018 -0.193190  0.490187
12/12/2018  0.376009  0.566752
13/12/2018 -1.500166 -0.922745

문제 - 12월 12일의 B 컬럼값 반환, loc/iloc 따른 반환값이 다름
- loc - numpy의 float64 타입으로 반환
- iloc - DataFrame 타입으로 반환

In [94]:
df.loc['12/12/2018',['A','B']]

A    0.376009
B    0.566752
Name: 12/12/2018, dtype: float64

In [95]:
type(df.loc['12/12/2018',['A','B']])

pandas.core.series.Series

In [96]:
df.loc['08/12/2018':'10/12/2018', ['A','B']]

                   A         B
08/12/2018  0.829195  1.635541
09/12/2018 -1.056494 -0.751412
10/12/2018 -1.776218 -1.835999

In [101]:
# index와 column의 숫자값으로 검색
df.iloc[[0, 1, 5], [0, 1]]

                   A         B
08/12/2018  0.829195  1.635541
09/12/2018 -1.056494 -0.751412
13/12/2018 -1.500166 -0.922745

In [103]:
df

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171
12/12/2018  0.376009  0.566752  1.126454 -0.676682
13/12/2018 -1.500166 -0.922745  0.379572  0.425073

In [104]:
df.iloc[[4],[1]]

                   B
12/12/2018  0.566752

In [106]:
type(df.iloc[[4],[1]])

pandas.core.frame.DataFrame

조건식을 반영한 데이터 도출

In [108]:
df

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171
12/12/2018  0.376009  0.566752  1.126454 -0.676682
13/12/2018 -1.500166 -0.922745  0.379572  0.425073

In [109]:
df[df.A >0]

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
12/12/2018  0.376009  0.566752  1.126454 -0.676682

In [112]:
# DataFrame 객체 복제해서 새로운 객체 생성해서 대입
df2= df.copy()
df2

                   A         B         C         D
08/12/2018  0.829195  1.635541  2.490758  0.062219
09/12/2018 -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018 -1.776218 -1.835999 -0.395524  0.865148
11/12/2018 -0.193190  0.490187 -0.050367 -0.327171
12/12/2018  0.376009  0.566752  1.126454 -0.676682
13/12/2018 -1.500166 -0.922745  0.379572  0.425073

In [126]:
df2.iloc[0,0]=10
df2

                    A         B         C         D
08/12/2018  10.000000  1.635541  2.490758  0.062219
09/12/2018  -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018  -1.776218 -1.835999 -0.395524  0.865148
11/12/2018  -0.193190  0.490187 -0.050367 -0.327171
12/12/2018   0.376009  0.566752  1.126454 -0.676682
13/12/2018  -1.500166 -0.922745  0.379572  0.425073

In [127]:
df3=df # df객체의 주소값 즉 객체 지향
df3.iloc[0,0]=10

In [128]:
df3

                    A         B         C         D
08/12/2018  10.000000  1.635541  2.490758  0.062219
09/12/2018  -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018  -1.776218 -1.835999 -0.395524  0.865148
11/12/2018  -0.193190  0.490187 -0.050367 -0.327171
12/12/2018   0.376009  0.566752  1.126454 -0.676682
13/12/2018  -1.500166 -0.922745  0.379572  0.425073

In [129]:
df

                    A         B         C         D
08/12/2018  10.000000  1.635541  2.490758  0.062219
09/12/2018  -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018  -1.776218 -1.835999 -0.395524  0.865148
11/12/2018  -0.193190  0.490187 -0.050367 -0.327171
12/12/2018   0.376009  0.566752  1.126454 -0.676682
13/12/2018  -1.500166 -0.922745  0.379572  0.425073

In [130]:
# 이미 존재하는 DataFrame에 새로운 column 추가
df2['E']= [1,2,3,4,np.nan,6]
df2

                    A         B         C         D    E
08/12/2018  10.000000  1.635541  2.490758  0.062219  1.0
09/12/2018  -1.056494 -0.751412 -0.255104 -0.360905  2.0
10/12/2018  -1.776218 -1.835999 -0.395524  0.865148  3.0
11/12/2018  -0.193190  0.490187 -0.050367 -0.327171  4.0
12/12/2018   0.376009  0.566752  1.126454 -0.676682  NaN
13/12/2018  -1.500166 -0.922745  0.379572  0.425073  6.0

In [131]:
df2['E'].isin([1,3,5,6])

08/12/2018     True
09/12/2018    False
10/12/2018     True
11/12/2018    False
12/12/2018    False
13/12/2018     True
Name: E, dtype: bool

In [132]:
df['A'].max()

10.0

In [133]:
df['A'].min()

-1.7762182922079852

In [136]:
#? A컬럼에서 최대값 - 최소값 연산하기
df['A'].max()-df['A'].min()

11.776218292207986

In [139]:
df[:].max()-df[:].min()

A    11.776218
B     3.471540
C     2.886282
D     1.541830
dtype: float64

In [145]:
# 사용자 정의 함수를 호출 또는 람다 표현식을 사용 가능한 DataFrame의 함수
df.apply(lambda x: x.max() - x.min()) # 연산식을 적용시키는 함수  apply()

A    11.776218
B     3.471540
C     2.886282
D     1.541830
dtype: float64

In [146]:
df

                    A         B         C         D
08/12/2018  10.000000  1.635541  2.490758  0.062219
09/12/2018  -1.056494 -0.751412 -0.255104 -0.360905
10/12/2018  -1.776218 -1.835999 -0.395524  0.865148
11/12/2018  -0.193190  0.490187 -0.050367 -0.327171
12/12/2018   0.376009  0.566752  1.126454 -0.676682
13/12/2018  -1.500166 -0.922745  0.379572  0.425073

In [147]:
#?  이 apply가 몇번 호출될지 파악하는 로직을 lambda로 단순 확인 해보기
df.apply(lambda x : print(x))

08/12/2018    10.000000
09/12/2018    -1.056494
10/12/2018    -1.776218
11/12/2018    -0.193190
12/12/2018     0.376009
13/12/2018    -1.500166
Name: A, dtype: float64
08/12/2018    1.635541
09/12/2018   -0.751412
10/12/2018   -1.835999
11/12/2018    0.490187
12/12/2018    0.566752
13/12/2018   -0.922745
Name: B, dtype: float64
08/12/2018    2.490758
09/12/2018   -0.255104
10/12/2018   -0.395524
11/12/2018   -0.050367
12/12/2018    1.126454
13/12/2018    0.379572
Name: C, dtype: float64
08/12/2018    0.062219
09/12/2018   -0.360905
10/12/2018    0.865148
11/12/2018   -0.327171
12/12/2018   -0.676682
13/12/2018    0.425073
Name: D, dtype: float64

A    None
B    None
C    None
D    None
dtype: object

**이미 존재하는 파일의 내용을 기반으로 DataFrame 생성하기**

In [151]:
# 외부폴더의 file을 read -> DataFrame 객체 생성하기
'''
이 파일이 내장된 경로 : C:\0.ITstudy\9.pandas\step01~
friends.csv : C:\0.ITstudy\0.dataSet\friends.csv
'''
df=pd.read_csv("../0.dataSet/friends.csv") #../으로 상위 0.ITstudy로 올라간뒤 0.dataSet으로 내려가서 csv파일 읽어옴
df

    이름   나이    직업   hobby
0  신동엽   20   연예인   music
1  유재석   41    교수     art
2  김새롬   18    학생   study
3  이영자   45   상담사    talk
4  강호동   38   연예인    talk

In [169]:
type(df)

pandas.core.frame.DataFrame

In [170]:
df['이름'][3]='이영자아'

C:\Users\Playdata\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [172]:
df.iloc[3,0]='이영순'

In [173]:
df

    이름   나이    직업   hobby
0  신동엽   20   연예인   music
1  유재석   41    교수     art
2  김새롬   18    학생   study
3  이영순   45   상담사    talk
4  강호동   38   연예인    talk

In [178]:
# tab으로 데이터를 구분한 파일의 내용으로 DataFrame 객체 생성하기
df = pd.read_csv("../0.dataSet/friendsTab.txt",delimiter="\t")
df

    이름  나이   직업  hobby
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

**원천 데이터(raw)에 컬럼명으로 사용될 header정보가 없을  경우 주의사항<br>
DataFrame 생성시 데이터의 첫 라인이 header 정보로 사용되지 않게
속성으로 제어해야 함<br>
1단계 실습: 신동엽 정보가 header 정보로 사용 ->column 추가시 -> 정보 손실발생<br>
2단계 실습: 신동엽 정보 손실없이 작업<br>
3단계 - DataFrame 생성 시점에 컬럼명 반영 가능**

In [183]:
# header 정보가 없는 파일을 read해서 가공하기
df = pd.read_csv("../0.dataSet/friendsTabNoHead.txt",delimiter="\t")
df

   신동엽  20  연예인  music
0  유재석  41   교수    art
1  김새롬  18   학생  study
2  이영자  45  상담사   talk
3  강호동  38  연예인   talk

In [180]:
df.columns

Index(['신동엽', '20', '연예인', 'music'], dtype='object')

In [181]:
df.columns=['name','age','job','hobby']

In [182]:
df

  name  age  job  hobby
0  유재석   41   교수    art
1  김새롬   18   학생  study
2  이영자   45  상담사   talk
3  강호동   38  연예인   talk

In [191]:
# 2단계
df = pd.read_csv("../0.dataSet/friendsTabNoHead.txt",delimiter="\t", header=None)
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [187]:
df.columns=['name','age','job','hobby']
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [192]:
# 3단계 - DataFrame 생성 시점에 컬럼명 반영 가능
df = pd.read_csv("../0.dataSet/friendsTabNoHead.txt",delimiter="\t", header=None, names=['name','age', 'job', 'hobby'])
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [280]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'}]

In [281]:
friend_dict_list

[{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'},
 {'name': '유재석', 'age': 41, 'job': '교수', 'hobby': 'art'},
 {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby': 'study'},
 {'name': '이영자', 'age': 45, 'job': '상담사', 'hobby': 'talk'},
 {'name': '강호동', 'age': 38, 'job': '연예인', 'hobby': 'talk'}]

In [282]:
type(friend_dict_list)

list

In [283]:
friend_dict_list[0]

{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby': 'music'}

In [284]:
friend_dict_list[0]['name']

'신동엽'

In [285]:
type(friend_dict_list[0]['name'])

str

In [286]:
df=pd.DataFrame(friend_dict_list)
df

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석
2   18  study   학생  김새롬
3   45   talk  상담사  이영자
4   38   talk  연예인  강호동

In [287]:
df.name

0    신동엽
1    유재석
2    김새롬
3    이영자
4    강호동
Name: name, dtype: object

In [288]:
df.head(2)

   age  hobby  job name
0   20  music  연예인  신동엽
1   41    art   교수  유재석

In [289]:
df=df[['name', 'age', 'job','hobby']]
df

  name  age  job  hobby
0  신동엽   20  연예인  music
1  유재석   41   교수    art
2  김새롬   18   학생  study
3  이영자   45  상담사   talk
4  강호동   38  연예인   talk

In [290]:
#? df2 라는 변수한테 friend_dict_list가 보유한 일반 python의 list로
# DataFrame 생성, 단 컬럼 순서는 name, age, job, hobby 순으로 생성
#? 생성 시점에 컬럼순서 정할 수 있나?
df2=pd.DataFrame(friend_dict_list, columns=['name','age','job','hobby'], index=['일','이','삼','사','오'])
df2

  name  age  job  hobby
일  신동엽   20  연예인  music
이  유재석   41   교수    art
삼  김새롬   18   학생  study
사  이영자   45  상담사   talk
오  강호동   38  연예인   talk

**정제한 DataFrame을 csv파일로 생성하기**

In [291]:
df2.to_csv("../0.dataSet/fi_out.csv", index=None)

**컬럼명도 배제해서 f2_out.csv 만들어보기**

In [292]:
df2.to_csv("../0.dataSet/fi_out2.csv",header=None,index=None)

In [293]:
#리스트로 데이터 프레임 생성하기 + header 추가 하기

friends = [['신동엽',20,'연예인','music'], 
           ['유재석',41,'교수','art'], 
           ['김새롬',18,'학생','study'], 
           ['이영자',45,'상담사','talk'], 
           ['강호동',38,'연예인','talk']]

df = pd.DataFrame.from_records(friends)

In [294]:
df

     0   1    2      3
0  신동엽  20  연예인  music
1  유재석  41   교수    art
2  김새롬  18   학생  study
3  이영자  45  상담사   talk
4  강호동  38  연예인   talk

In [295]:
df.columns=['name','age','job','hobby']

In [296]:
df['salary']=0
df

  name  age  job  hobby  salary
0  신동엽   20  연예인  music       0
1  유재석   41   교수    art       0
2  김새롬   18   학생  study       0
3  이영자   45  상담사   talk       0
4  강호동   38  연예인   talk       0

In [ ]:
# job이 학생이 아닌경우 salary 값이 yes, 학생인 경우 no값으로 치환하기
# np.where()
'''
    salary 컬럼에 no or yes 대입 : df['salary'] = 'no' or 'yes'
    
    상황에 따른 조건 job 학생? non-학생? : df['job'] != '학생'
    
    삼항연산자
        보편적인 프로그램 언어 문법 = 조건식? true 일때 : false일때
'''

In [299]:
df['salary']=np.where(df['job']!="학생", 'yes','no')

In [300]:
df

  name  age  job  hobby salary
0  신동엽   20  연예인  music    yes
1  유재석   41   교수    art    yes
2  김새롬   18   학생  study     no
3  이영자   45  상담사   talk    yes
4  강호동   38  연예인   talk    yes

# 중복값 찾아내 제거하기
찾아내기:df=df.duplicated()<br>
삭제하기:df=df.drop_duplicates()

In [272]:
df.duplicated()

In [274]:
df

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [277]:
df=df.drop_duplicates()

In [278]:
df

0    False
dtype: bool

In [433]:

friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                   {'name': '신동엽', 'age': np.nan, 'job': '연예인', 'hobby':'music'}]
df=pd.DataFrame(friend_dict_list)
df

    age  hobby  job name
0  20.0  music  연예인  신동엽
1  41.0    art   교수  유재석
2  18.0  study   학생  김새롬
3  45.0   talk  상담사  이영자
4  38.0   talk  연예인  강호동
5   NaN  music  연예인  신동엽

In [366]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [367]:
df=df.drop_duplicates(['name'], keep=0)

In [368]:
df

  age  hobby  job name
1  41    art   교수  유재석
2  18  study   학생  김새롬
3  45   talk  상담사  이영자
4  38   talk  연예인  강호동

**keep : first일 경우 첫번째 중복값 제거<br>　　　last일경우 나중에오는 중복값 제거<br>　　　false(or 0)일 경우 중복값 모두 제거**

**inplace = True : 원본 DataFrame에 영향을 주는 속성**

In [369]:
# inplace=True : 원본 DataFrame에 영향을 주는 속성 
df.drop_duplicates(['name'], keep='last',inplace=True)

C:\Users\Playdata\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [370]:
df

  age  hobby  job name
1  41    art   교수  유재석
2  18  study   학생  김새롬
3  45   talk  상담사  이영자
4  38   talk  연예인  강호동

In [379]:
# 결측치 확인 함수, 결측치인경우에만 True #결측치:항목에 대한 값이 존재하지 않는 것
df=df.isna()
df

     age  hobby    job   name
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [394]:
df['age'].sum() / df['name'].count()

27.0

In [391]:
print("합계 : " ,df['age'].sum())
print("평균 : ", df['age'].mean())

합계 :  162.0
평균 :  32.4
32.4

In [384]:
df['age'].mean()

32.4

In [378]:
df['age']

0    False
1    False
2    False
3    False
4    False
5     True
Name: age, dtype: bool


**non값을 0으로 치환, 평균을 제대로 도출**

방법1

In [ ]:
df=df['age'].fillna(0)

In [412]:
df=df.mean()

In [413]:
df

27.0

방법2

In [434]:
df.loc[df['age'].isnull(),'age']=0

In [435]:
df=df.mean()

In [436]:
df

age    27.0
dtype: float64

방법3

In [427]:
# inplcae는 대입안해도 적용되는것
df['age'].fillna(0,inplace=True)

In [429]:
df=df.mean()

In [431]:
df

age    27.0
dtype: float64

In [529]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' :  '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                    {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'} ]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   NaN  연예인  music

In [523]:
# age 컬럼의 결측치 NaN 부분을 0으로 변경해 보기(원본 수정 불가)
df['age'].fillna(0)
df.fillna(0)

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽   0.0  연예인  music

In [530]:
type(df.fillna(0))

pandas.core.frame.DataFrame

In [531]:
type(df['age'].fillna(0))

pandas.core.series.Series

In [532]:
# age의 평균을 구해서 두번째 동명이인의 신동엽에게 대입
df['age'].fillna(df.groupby("job")['age'].transform('median'), inplace=True)

In [533]:
df

  name   age  job  hobby
0  신동엽  20.0  연예인  music
1  유재석  41.0   교수    art
2  김새롬  18.0   학생  study
3  이영자  45.0  상담사   talk
4  강호동  38.0  연예인   talk
5  신동엽  29.0  연예인  music

In [506]:
df.describe()

             age
count   6.000000
mean   23.833333
std    15.664184
min     6.000000
25%    14.250000
50%    19.000000
75%    35.750000
max    45.000000

In [538]:
df.groupby('job')['age']

중복데이터 관련된 unique 처리 기술 학습

1. db의 distinct와 같은 기능 학습
- oracle db의 emp의 job의 종류가 중복되지 않게 검색
- select distinct job from emp;

In [ ]:
friend_dict_list = [{'name': '신동엽', 'age': 20, 'job': '연예인', 'hobby':'music'},
                     {'name': '유재석', 'age': 41, 'job': '교수', 'hobby':'art'},
                     {'name': '김새롬', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '이영자', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '강호동', 'age' : 38, 'job' : '연예인', 'hobby' : 'talk'},
                     {'name': '신동엽', 'age': None, 'job': '연예인', 'hobby':'music'},
                     {'name': '고현정', 'age': 44, 'job': '가수', 'hobby':'music'},
                     {'name': '박민영', 'age': 22, 'job': '학생', 'hobby':'art'},
                     {'name': '박서준', 'age': 18, 'job': '학생', 'hobby':'study'},
                     {'name': '박보검', 'age' : 45, 'job': '상담사', 'hobby' : 'talk'},
                     {'name' : '이효리', 'age' : 28, 'job' : '교수', 'hobby' : 'talk'},
                    {'name': '이상순', 'age': 29, 'job': '주부', 'hobby':'music'}]

df = pd.DataFrame(friend_dict_list)
df = df[['name', 'age', 'job', 'hobby']]

In [540]:
print(df.job.unique())

['연예인' '교수' '학생' '상담사']

In [541]:
df.job.unique()

array(['연예인', '교수', '학생', '상담사'], dtype=object)

In [542]:
df.job.value_counts()

연예인    3
상담사    1
교수     1
학생     1
Name: job, dtype: int64

In [547]:
# hobby에 대해서 종류 검색 -> 개수파악->hobby별 인원수 파악
df.hobby.value_counts()

music    2
talk     2
study    1
art      1
Name: hobby, dtype: int64

두개의 데이터 병합하기-row기준

In [561]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [549]:
df1

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [554]:
df2

  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [555]:
type(l1)

list

In [556]:
type(df1)

pandas.core.frame.DataFrame

In [557]:
df3=[df1,df2]

In [558]:
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [559]:
df4=pd.concat(df3)
df4

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [560]:
df5=pd.concat(df3, ignore_index=True)
df5

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인

두개의 DataFrame병합하기 - column 기준

In [637]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [638]:
df3=[df1,df2]

In [639]:
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [640]:
df4= pd.concat(df3, axis=1, ignore_index=True)

In [641]:
df4

     0    1    2     3
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [642]:
#? 컬럼 순서를 0 3 2 1 순서 변경해보기
df4=df4[[0,3,2,1]]
df4

     0     3    2    1
0  이효리  치과의사  신동엽   교수
1  이상순    농부  이영자   학생
2  박보검   연예인  정찬우  개발자

In [649]:
#? 컬럼명 수정 name, job
df4.columns=['name','job','name','job']
df4

  name   job name  job
0  이효리  치과의사  신동엽   교수
1  이상순    농부  이영자   학생
2  박보검   연예인  정찬우  개발자

In [650]:
dataOne=df4.iloc[:, [0,1]]
dataOne

  name   job
0  이효리  치과의사
1  이상순    농부
2  박보검   연예인

In [651]:
dataTwo=df4.iloc[:, [2,3]]
dataTwo

  name  job
0  신동엽   교수
1  이영자   학생
2  정찬우  개발자

In [652]:
dataTotal=[dataOne,dataTwo]

In [653]:
dataTotal

[  name   job
 0  이효리  치과의사
 1  이상순    농부
 2  박보검   연예인,   name  job
 0  신동엽   교수
 1  이영자   학생
 2  정찬우  개발자]

In [654]:
finalData=pd.concat(dataTotal, ignore_index=True)

In [655]:
finalData

  name   job
0  이효리  치과의사
1  이상순    농부
2  박보검   연예인
3  신동엽    교수
4  이영자    학생
5  정찬우   개발자

In [634]:
l1 = [{'name': '이효리', 'job': "교수"},
      {'name': '이상순', 'job': "학생"},
      {'name': '박보검', 'job': "개발자"}]

l2 = [{'name': '신동엽', 'job': "치과의사"},
      {'name': '이영자', 'job': "농부"},
      {'name': '정찬우', 'job': "연예인"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [635]:
df3=[df1,df2]
df3

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [656]:
df4=pd.concat(df3,axis=1, ignore_index=True)
df4

     0    1    2     3
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [657]:
df4.columns=['name','job','name','job']
df4

  name  job name   job
0  이효리   교수  신동엽  치과의사
1  이상순   학생  이영자    농부
2  박보검  개발자  정찬우   연예인

In [733]:
dataone=df4.iloc[:, [0,1]]
dataone

  name  job
0  이효리   교수
1  이상순   학생
2  박보검  개발자

In [659]:
datatwo=df4.iloc[:, [2,3]]
datatwo

  name   job
0  신동엽  치과의사
1  이영자    농부
2  정찬우   연예인

In [660]:
total=[dataone, datatwo]
total

[  name  job
 0  이효리   교수
 1  이상순   학생
 2  박보검  개발자,   name   job
 0  신동엽  치과의사
 1  이영자    농부
 2  정찬우   연예인]

In [661]:
total2=pd.concat(total, ignore_index=True)
total2

  name   job
0  이효리    교수
1  이상순    학생
2  박보검   개발자
3  신동엽  치과의사
4  이영자    농부
5  정찬우   연예인

In [865]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
         {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
         {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

df = pd.DataFrame(friend_dict_list, columns = ['이름', '중간고사점수', '기말고사점수'])
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

**1. 학생들의 중간, 기말고사 성적만으로 '총점' 과 '평점'추가하기**

In [866]:
total=df.sum(axis=1)
total

0    180
1    165
2     40
dtype: int64

In [867]:
d=[df,total]
d2=pd.concat(d, axis=1, ignore_index=True)
d2

      0   1   2    3
0  나학생1  95  85  180
1  나학생2  85  80  165
2  나학생3  10  30   40

In [868]:
a=df.mean(axis=1)

In [869]:
d3=[d2,a]
d3
T=pd.concat(d3, axis=1, ignore_index=True)
T

      0   1   2    3     4
0  나학생1  95  85  180  90.0
1  나학생2  85  80  165  82.5
2  나학생3  10  30   40  20.0

In [870]:
T.columns=['이름', '중간고사성적','기말고사성적','총점','평점']
T

     이름  중간고사성적  기말고사성적   총점    평점
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [871]:
T['등급']=T['평점']

**2. DataFrame도 반복문으로 처리 가능. 평균값을 반복문(for) 활용해서 출력해보기**

In [872]:
for i in T.itertuples(index=False):
    print(np.asarray(i))

['나학생1' '95' '85' '180' '90.0' '90.0']
['나학생2' '85' '80' '165' '82.5' '82.5']
['나학생3' '10' '30' '40' '20.0' '20.0']

In [873]:
for i in T['평점']:
    print("평점: {}".format(i))

평점: 90.0
평점: 82.5
평점: 20.0

In [874]:
for i in T:
    print(i+1)

TypeError: can only concatenate str (not "int") to str

**3. grade(등급)이라는 컬럼 추가, 90점이상(A), 80점이상(B) 그외 F등급 조건식 활용해서 파이썬 코드로 처리해 보기**

In [875]:
a=T.iloc[:, [4]]

In [876]:
grade=[]
for avg in T['평점']:
    if avg >=90:
        grade.append('A')
    elif avg >=80:
        grade.append('B')
    else:
        grade.append('F')

In [877]:
grade

['A', 'B', 'F']

In [878]:
T['등급']=grade
T

     이름  중간고사성적  기말고사성적   총점    평점 등급
0  나학생1      95      85  180  90.0  A
1  나학생2      85      80  165  82.5  B
2  나학생3      10      30   40  20.0  F

**문제4<br> '이수여부' 라는 컬럼을 추가하되 등급을 기준으로 F인 경우 fail/F<br>아닌 경우 pass값으로 반영<br> 
단 lambda문법으로 처리해보기**

In [879]:
T['이수여부']=T['등급'].apply(lambda v: 'pass' if v!= 'F' else 'fail')
T

     이름  중간고사성적  기말고사성적   총점    평점 등급  이수여부
0  나학생1      95      85  180  90.0  A  pass
1  나학생2      85      80  165  82.5  B  pass
2  나학생3      10      30   40  20.0  F  fail

In [880]:
T['등급']=='F'

0    False
1    False
2     True
Name: 등급, dtype: bool

In [887]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])

df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [888]:
for v in df['yyyy-mm-dd']:
    print(v.split('-'))

['2000', '06', '27']
['2002', '09', '24']
['2018', '12', '20']

In [884]:
for v in df['yyyy-mm-dd']:
    print(v.split('-')[0])

2000
2002
2018

In [890]:
'''
    사용자 정의 함수 개발 ->apply()에서 호출
    호출 문법 : apply(함수명)
'''
def getYear(row):
    return row.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply( getYear )
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2018-12-20  2018

In [892]:
type(df['year'][0])

str

In [893]:
def getAge(year, currentYear):
    return currentYear - int(year)
df['age']=df['year'].apply(getAge, currentYear=2018)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2018-12-20  2018    0

In [901]:
def getInfo(age, prefix, suffix):
    return prefix+str(age)+suffix

In [902]:
df['info']=df['age'].apply(getInfo, prefix='내 나이는 ',suffix='살')
df

   yyyy-mm-dd  year  age       info
0  2000-06-27  2000   18  내 나이는 18살
1  2002-09-24  2002   16  내 나이는 16살
2  2018-12-20  2018    0   내 나이는 0살

In [918]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [921]:
for name, group in groupby_major:
    print(name+group)

                       name                             major  \
0      Computer ScienceJohn  Computer ScienceComputer Science
1      Computer ScienceNate  Computer ScienceComputer Science
6  Computer ScienceJeniffer  Computer ScienceComputer Science
7    Computer ScienceEdward  Computer ScienceComputer Science

                   gender
0    Computer Sciencemale
1    Computer Sciencemale
6  Computer Sciencefemale
7    Computer Sciencemale
             name               major           gender
4  EconomicsJanny  EconomicsEconomics  Economicsfemale
5   EconomicsYuna  EconomicsEconomics  Economicsfemale
9  EconomicsWendy  EconomicsEconomics  Economicsfemale
             name           major       gender
2  PhysicsAbraham  PhysicsPhysics  Physicsmale
               name                 major            gender
3   PsychologyBrian  PsychologyPsychology    Psychologymale
8    PsychologyZara  PsychologyPsychology  Psychologyfemale
10   PsychologySera  PsychologyPsychology  Psychologyfemale

In [906]:
groupby_major=df.groupby('major')
groupby_major

In [910]:
# 그룹별 정보 확인 속성
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [912]:
#그룹 변수는 각 컬럼명 사용 가능
#호출 가능 속성명:name/major/gender
groupby_major.gender

In [935]:
'''
name 변수: 변수명 가변적
           보유하게 되는 데이터값은 grouping된 데이터 이름
group 변수: 변수명 가변적
            보유하게 되는 데이터
            해당 그룹에 소속된 index와 각 컬럼명 데이터들
            
'''
for name, group in groupby_major:
    print(name+ ' : ' + str(len(group)))
    print(type(group))
    print()

Computer Science : 4
Economics : 3
Physics : 1
Psychology : 3

그룹 객체를 새로운 DataFrame 객체로 생성해보기<br>
pd.DataFrame(키:밸류)

In [928]:
df2=pd.DataFrame({'count':groupby_major.size()})
df2

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [929]:
groupby_major.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [931]:
df3=pd.DataFrame({'count':groupby_major.size()}).reset_index()
df3

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [932]:
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

마지막 문제<br>
1. gender별로 그룹화 하기
- 그룹 단위로 이름, 전공, 성별 구조로 출력하기
- 성별 인원수로 새로운 DataFrame 생성하기(count라는 컬럼명 추가)

In [933]:
groupby_gender=df.groupby('gender')
groupby_gender

In [942]:
aa=pd.DataFrame({'count':groupby_gender.size()})
aa

        count
gender
female      6
male        5

In [944]:
aa2=pd.DataFrame({'count':groupby_gender.size()}).reset_index()
aa2

   gender  count
0  female      6
1    male      5

In [950]:
for name, major in groupby_gender:
    print(name, major)

female         name             major  gender
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
male       name             major gender
0     John  Computer Science   male
1     Nate  Computer Science   male
2  Abraham           Physics   male
3    Brian        Psychology   male
7   Edward  Computer Science   male

In [ ]:
df5=pd.